## plan
```diff
+ Green
- Red
! Orange
@@ Pink @@
#Gray
random_id.this: Refreshing state... [id=3A]
data.http.my_public_ip: Reading...
data.http.my_public_ip: Read complete after 1s [id=https://ifconfig.co/json]
aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-0e60bd76d51edd1e41080289494]
data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
aws_vpc.this[0]: Refreshing state... [id=vpc-0253c98dbfb2527bc]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
random_shuffle.az: Refreshing state... [id=-]
aws_subnet.private[0]: Refreshing state... [id=subnet-05d3787cbf200ae15]
aws_subnet.public[0]: Refreshing state... [id=subnet-0bcb86926463a54da]
aws_security_group.lan[0]: Refreshing state... [id=sg-05eea34b7c5aad93d]
aws_security_group.public[0]: Refreshing state... [id=sg-06ed1ac4a4a40a5df]
aws_security_group.trusted[0]: Refreshing state... [id=sg-0f1628227c3620510]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0bb7ce12cebee95cc]
aws_route_table.public[0]: Refreshing state... [id=rtb-0e60bd76d51edd1e4]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-0e595e0f3257b20f7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy

Terraform will perform the following actions:

  # aws_internet_gateway_attachment.this will be created
+   resource "aws_internet_gateway_attachment" "this" {
+       id                  = (known after apply)
+       internet_gateway_id = "igw-0bb7ce12cebee95cc"
+       vpc_id              = "vpc-0253c98dbfb2527bc"
    }

  # aws_network_interface.private will be created
+   resource "aws_network_interface" "private" {
+       arn                       = (known after apply)
+       description               = "ENI for private subnet"
+       id                        = (known after apply)
+       interface_type            = (known after apply)
+       ipv4_prefix_count         = (known after apply)
+       ipv4_prefixes             = (known after apply)
+       ipv6_address_count        = (known after apply)
+       ipv6_address_list         = (known after apply)
+       ipv6_address_list_enabled = false
+       ipv6_addresses            = (known after apply)
+       ipv6_prefix_count         = (known after apply)
+       ipv6_prefixes             = (known after apply)
+       mac_address               = (known after apply)
+       outpost_arn               = (known after apply)
+       owner_id                  = (known after apply)
+       private_dns_name          = (known after apply)
+       private_ip                = (known after apply)
+       private_ip_list           = (known after apply)
+       private_ip_list_enabled   = false
+       private_ips               = (known after apply)
+       private_ips_count         = (known after apply)
+       security_groups           = [
+           "sg-05eea34b7c5aad93d",
        ]
+       source_dest_check         = true
+       subnet_id                 = "subnet-05d3787cbf200ae15"
+       tags                      = {
+           "Name" = "priv-eni-sophos-xgdc-447552758530"
        }
+       tags_all                  = {
+           "Name" = "priv-eni-sophos-xgdc-447552758530"
        }

+       attachment {
+           attachment_id = (known after apply)
+           device_index  = (known after apply)
+           instance      = (known after apply)
        }
    }

  # aws_network_interface.public will be created
+   resource "aws_network_interface" "public" {
+       arn                       = (known after apply)
+       description               = "ENI for Public Subnet"
+       id                        = (known after apply)
+       interface_type            = (known after apply)
+       ipv4_prefix_count         = (known after apply)
+       ipv4_prefixes             = (known after apply)
+       ipv6_address_count        = (known after apply)
+       ipv6_address_list         = (known after apply)
+       ipv6_address_list_enabled = false
+       ipv6_addresses            = (known after apply)
+       ipv6_prefix_count         = (known after apply)
+       ipv6_prefixes             = (known after apply)
+       mac_address               = (known after apply)
+       outpost_arn               = (known after apply)
+       owner_id                  = (known after apply)
+       private_dns_name          = (known after apply)
+       private_ip                = (known after apply)
+       private_ip_list           = (known after apply)
+       private_ip_list_enabled   = false
+       private_ips               = (known after apply)
+       private_ips_count         = (known after apply)
+       security_groups           = [
+           "sg-06ed1ac4a4a40a5df",
+           "sg-0f1628227c3620510",
        ]
+       source_dest_check         = true
+       subnet_id                 = "subnet-0bcb86926463a54da"
+       tags                      = {
+           "Name" = "pub-eni-sophos-xgdc-447552758530"
        }
+       tags_all                  = {
+           "Name" = "pub-eni-sophos-xgdc-447552758530"
        }

+       attachment {
+           attachment_id = (known after apply)
+           device_index  = (known after apply)
+           instance      = (known after apply)
        }
    }

  # aws_route.private will be created
+   resource "aws_route" "private" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # aws_route.public will be created
+   resource "aws_route" "public" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = "igw-0bb7ce12cebee95cc"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = "rtb-0e60bd76d51edd1e4"
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # aws_route.public_internet_gateway will be destroyed
  # (because aws_route.public_internet_gateway is not in configuration)
-   resource "aws_route" "public_internet_gateway" {
-       destination_cidr_block = "0.0.0.0/0" -> null
-       gateway_id             = "igw-0bb7ce12cebee95cc" -> null
-       id                     = "r-rtb-0e60bd76d51edd1e41080289494" -> null
-       origin                 = "CreateRoute" -> null
-       route_table_id         = "rtb-0e60bd76d51edd1e4" -> null
-       state                  = "active" -> null

-       timeouts {
-           create = "5m" -> null
        }
    }

  # aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "priv-rtb-sophos-xgdc-447552758530"
        }
+       tags_all         = {
+           "Name" = "priv-rtb-sophos-xgdc-447552758530"
        }
+       vpc_id           = "vpc-0253c98dbfb2527bc"
    }

  # aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-0f1628227c3620510"
      ~ ingress                = [
-           {
-               cidr_blocks      = [
-                   "0.0.0.0/0",
                ]
-               description      = "Allow all from trusted IP"
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 65535
            },
+           {
+               cidr_blocks      = [
+                   "23.96.118.64/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
        tags                   = {
            "Name" = "Trusted Network"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 6 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...     
```